Autodesk.Navisworks.Api.Plugins.CommandHandlerPluginRecord
Represents an CommandHandlerPlugin record in Navisworks

Autodesk.Navisworks.Api.Plugins.CommandHandlerPluginRecord.CanExecuteCommand(System.String)
Calls CanExecuteCommand on the plugin
commandId:
The Id of the command
Throws System.ArgumentException:
Invalid Id

Autodesk.Navisworks.Api.Plugins.CommandHandlerPluginRecord.CanExecuteRibbonTab(System.String)
Calls CanExecuteRibbonTab on the plugin
ribbonId:
The Id of the ribbon tab
Throws Autodesk.Navisworks.Api.Plugins.PluginLoadException:
Plugin failed to load
Throws System.ArgumentException:
Invalid Id

Autodesk.Navisworks.Api.Plugins.CommandHandlerPluginRecord.CommandRecords
Commands defined by this plugin

Autodesk.Navisworks.Api.Plugins.CommandHandlerPluginRecord.ExecuteCommand(System.String,System.String[])
Calls ExecuteCommand on the plugin
commandId:
The Id of the command
parameters:
Paramaters to be passed to the command
Throws Autodesk.Navisworks.Api.Plugins.ExecuteDisabledException:
Execute is Disabled via CanExecute
Throws Autodesk.Navisworks.Api.Plugins.PluginLoadException:
Plugin failed to load
Throws System.ArgumentException:
Invalid Id

Autodesk.Navisworks.Api.Plugins.CommandHandlerPluginRecord.ExtractNameFromId(System.String)
Helper to extract a name from a Id.

Autodesk.Navisworks.Api.Plugins.CommandHandlerPluginRecord.LoadedPlugin
Gets the plugin if loaded, otherwise null

Autodesk.Navisworks.Api.Plugins.CommandHandlerPluginRecord.LoadPlugin
Returns the plugin, loads it if required
Throws Autodesk.Navisworks.Api.Plugins.PluginLoadException: Plugin failed to load

Autodesk.Navisworks.Api.Plugins.CommandHandlerPluginRecord.MakeIdFromName(System.String)
Helper to make an Id from a name

Autodesk.Navisworks.Api.Plugins.CommandHandlerPluginRecord.RibbonLayoutRecords
Xaml files that define the layout of the RibbonTabs and Commands

Autodesk.Navisworks.Api.Plugins.CommandHandlerPluginRecord.RibbonTabRecords
Ribbon Tabs defined by this plugin

Autodesk.Navisworks.Api.Plugins.CommandHandlerPluginRecord.ShowCommandHelp(System.String)
Calls TryShowCommandHelp on the plugin
commandId:
The Id of the command
Throws Autodesk.Navisworks.Api.Plugins.PluginLoadException:
Plugin failed to load
Throws System.ArgumentException:
Invalid Id

Autodesk.Navisworks.Api.Plugins.CommandHandlerPluginRecord.ToolTipsRecords
ToolTips files that define tooltips for RibbonTabs and Commands

Autodesk.Navisworks.Api.Plugins.CommandHandlerPluginRecord.TryLoadPlugin
Returns the plugin, loads it if required
Returns:
null if plugin failed to load

Autodesk.Navisworks.Api.Plugins.CommandHandlerPluginRecord.TryShowCommandHelp(System.String)
Calls TryShowCommandHelp on the plugin
commandId:
The Id of the command